# On executing msconfig, without appropriate UAC settings enforced (ALWAYS NOTIFY) msconfig will default to auto-elevate, setting the integrity level to High, from here within the Tools section 'Comamnd Prompt' can be launched and will run with a high IL token
# mmc.exe and regedit.exe spawn with no registered parent, additionally Control Panel related applications will need to pass UAC for accessing sensitive options.
# Detection: Parent Process = msconfig.exe Process = Cmd.exe / UserAccountControlSettings.exe (modify UAC permissions), 

title: msconfig-UAC-Bypass_1.sigma
id: 
status: Testing
description: On executing msconfig, without appropriate UAC settings enforced (ALWAYS NOTIFY) msconfig will default to auto-elevate, setting the integrity level to High, from here within the Tools section 'Comamnd Prompt' can be launched and will run with a high IL token
references:
    - https://twitter.com/empise_/status/1665886182213918721/photo/1
author: Kynan Jones
date: 2023/06/06
tags:
    - attack.defense_evasion
    - attack.privilege_escalation
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentProcess: 'msconfig.exe'
    selection1|endswith:
      Process: 'cmd.exe'
      Process: 'UserAccountControlSettings.exe'
      Verify fieldname.
      
    condition: selection AND any of selection1
    
falsepositives:
    - Unknown
level: high
