id: UCXX-XX
title: CertOc-Abuse
status: development
version: 1.0
description: Tracks exporting, converting or importing of privilege configuration file which can be exported and modified with the right permissions (SeBackupPrivilege, SeRestorePrivilege) used to escalate privileges without modifying any group membership
author: Kynan Jones
reference: 
    - xxx
    - xxx
logsource:
    category: endpoint
    product: windows
    service: /os/process/create
detection:
    selection:
        process_path:
        - 'C:\\Windows\\System32\\SecEdit.exe'
    selection1:
        process|contains|all:
        - '/cfg '
        - '.inf'
    selection2:
        process|contains:
        - '/export '
    selection3:
        process|contains:
        - '/configure '
        - '.sdb'
        - '/db '
    selection4:
        process|contains:
        - '/import '
        - '.sdb'
        - '/db '     
    condition: selection AND selection1 AND selection2 OR selection3 OR selection4 
fields:
//
//
falsepositives: Legitimate analysis of system security by comparing your current security configuration against specified security templates.
severity: 3
//
tags:
    - attack.command_xx
    - attack.defense_exx
    - attack.t1xx
    - attack.t1xx
